Revit 2027 API
BuiltInFailures.MEPFabricationFailures.FabricationPartExceededAngleFlexToleranceWarning Property
 The angle flex is greater than the maximum angle flex tolerance defined by the fabrication part. Connections with this part may not be properly aligned and may appear to be skewed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FabricationPartExceededAngleFlexToleranceWarning { get; }
Public Shared ReadOnly Property FabricationPartExceededAngleFlexToleranceWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FabricationPartExceededAngleFlexToleranceWarning {
	FailureDefinitionId^ get ();
}
static member FabricationPartExceededAngleFlexToleranceWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace